**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [26]:
import numpy as np
import pandas as pd
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

birds=pd.DataFrame.from_dict(data)
birds

   age       birds priority  visits
0  3.5      Cranes      yes       2
1  4.0      Cranes      yes       4
2  1.5     plovers       no       3
3  NaN  spoonbills      yes       4
4  6.0  spoonbills       no       3
5  3.0      Cranes       no       4
6  5.5     plovers       no       2
7  NaN      Cranes      yes       2
8  8.0  spoonbills       no       3
9  4.0  spoonbills       no       2

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [27]:
birds.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [28]:
birds.head(2)

   age   birds priority  visits
0  3.5  Cranes      yes       2
1  4.0  Cranes      yes       4

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [29]:
birds[['age','birds']]

   age       birds
0  3.5      Cranes
1  4.0      Cranes
2  1.5     plovers
3  NaN  spoonbills
4  6.0  spoonbills
5  3.0      Cranes
6  5.5     plovers
7  NaN      Cranes
8  8.0  spoonbills
9  4.0  spoonbills

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [30]:
birds.iloc[[2,3,7],[0,1,3]]

   age       birds  visits
2  1.5     plovers       3
3  NaN  spoonbills       4
7  NaN      Cranes       2

**6. select the rows where the number of visits is less than 4**

In [31]:
birds.loc[birds['visits']<4]

   age       birds priority  visits
0  3.5      Cranes      yes       2
2  1.5     plovers       no       3
4  6.0  spoonbills       no       3
6  5.5     plovers       no       2
7  NaN      Cranes      yes       2
8  8.0  spoonbills       no       3
9  4.0  spoonbills       no       2

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [32]:
birds.loc[birds['age'].isna(),['birds','visits']]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [33]:
birds.loc[(birds['birds']=='Cranes') & (birds['age']<4),:]

   age   birds priority  visits
0  3.5  Cranes      yes       2
5  3.0  Cranes       no       4

**9. Select the rows the age is between 2 and 4(inclusive)**

In [34]:
birds.loc[(birds['age']>=2) & (birds['age']<=4),:]

   age       birds priority  visits
0  3.5      Cranes      yes       2
1  4.0      Cranes      yes       4
5  3.0      Cranes       no       4
9  4.0  spoonbills       no       2

**10. Find the total number of visits of the bird Cranes**

In [35]:
birds.loc[birds['birds']=='Cranes','visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [36]:
birds.groupby('birds').mean().loc[:,'age']

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [37]:
birds.loc[len(birds)]=[7,"Cranes",'No',12]

birds
birds.drop(birds.index[[len(birds)-1]],inplace=True)
birds
#birds.drop(birds.index[0])

   age       birds priority  visits
0  3.5      Cranes      yes       2
1  4.0      Cranes      yes       4
2  1.5     plovers       no       3
3  NaN  spoonbills      yes       4
4  6.0  spoonbills       no       3
5  3.0      Cranes       no       4
6  5.5     plovers       no       2
7  NaN      Cranes      yes       2
8  8.0  spoonbills       no       3
9  4.0  spoonbills       no       2

**13. Find the number of each type of birds in dataframe (Counts)**

In [38]:
birds.groupby(['birds']).count().loc[:,'age']

birds
Cranes        3
plovers       2
spoonbills    3
Name: age, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [39]:
birds.sort_values(by=['age','visits'],ascending=[False,True])

   age       birds priority  visits
8  8.0  spoonbills       no       3
4  6.0  spoonbills       no       3
6  5.5     plovers       no       2
9  4.0  spoonbills       no       2
1  4.0      Cranes      yes       4
0  3.5      Cranes      yes       2
5  3.0      Cranes       no       4
2  1.5     plovers       no       3
7  NaN      Cranes      yes       2
3  NaN  spoonbills      yes       4

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [40]:
#birds['priority']=birds['priority'].map({'no':0,'yes':1}) 
#not sure why this didn't work
'''ref:  https://stackoverflow.com/questions/23307301/replacing-column-values-in-a-pandas-dataframe'''

birds.loc[birds['priority']=='no','priority']=0
birds.loc[birds['priority']=='yes','priority']=1
birds

   age       birds  priority  visits
0  3.5      Cranes         1       2
1  4.0      Cranes         1       4
2  1.5     plovers         0       3
3  NaN  spoonbills         1       4
4  6.0  spoonbills         0       3
5  3.0      Cranes         0       4
6  5.5     plovers         0       2
7  NaN      Cranes         1       2
8  8.0  spoonbills         0       3
9  4.0  spoonbills         0       2

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [41]:
birds.loc[birds['birds']=='Cranes','birds']='trumpeters'
birds

   age       birds  priority  visits
0  3.5  trumpeters         1       2
1  4.0  trumpeters         1       4
2  1.5     plovers         0       3
3  NaN  spoonbills         1       4
4  6.0  spoonbills         0       3
5  3.0  trumpeters         0       4
6  5.5     plovers         0       2
7  NaN  trumpeters         1       2
8  8.0  spoonbills         0       3
9  4.0  spoonbills         0       2